// const tsl_category_id_list = [
//     {
//         "id": "EB011000",
//         "name": "水泥"
//     },
//     {
//         "id": "EB012000",
//         "name": "食品"
//     },
//     {
//         "id": "EB013000",
//         "name": "塑膠"
//     },
//     {
//         "id": "EB014000",
//         "name": "紡織纖維"
//     },
//     {
//         "id": "EB015000",
//         "name": "電機機械"
//     },
//     {
//         "id": "EB016000",
//         "name": "電器電纜"
//     },
//     {
//         "id": "EB017000",
//         "name": "化學生技醫療"
//     },
//     {
//         "id": "EB030000",
//         "name": "化工"
//     },
//     {
//         "id": "EB031000",
//         "name": "生技醫療"
//     },
//     {
//         "id": "EB018000",
//         "name": "玻璃陶瓷"
//     },
//     {
//         "id": "EB019000",
//         "name": "造紙"
//     },
//     {
//         "id": "EB020000",
//         "name": "鋼鐵"
//     },
//     {
//         "id": "EB021000",
//         "name": "橡膠"
//     },
//     {
//         "id": "EB022000",
//         "name": "汽車"
//     },
//     {
//         "id": "EB023000",
//         "name": "電子"
//     },
//     {
//         "id": "EB032000",
//         "name": "半導體"
//     },
//     {
//         "id": "EB033000",
//         "name": "電腦及週邊設備"
//     },
//     {
//         "id": "EB034000",
//         "name": "光電"
//     },
//     {
//         "id": "EB035000",
//         "name": "通信網路"
//     },
//     {
//         "id": "EB036000",
//         "name": "電子零組件"
//     },
//     {
//         "id": "EB037000",
//         "name": "電子通路"
//     },
//     {
//         "id": "EB038000",
//         "name": "資訊服務"
//     },
//     {
//         "id": "EB039000",
//         "name": "其他電子"
//     },
//     {
//         "id": "EB025000",
//         "name": "建材營造"
//     },
//     {
//         "id": "EB026000",
//         "name": "航運業"
//     },
//     {
//         "id": "EB027000",
//         "name": "觀光"
//     },
//     {
//         "id": "EB028000",
//         "name": "金融保險"
//     },
//     {
//         "id": "EB029000",
//         "name": "貿易百貨"
//     },
//     {
//         "id": "EB040000",
//         "name": "油電燃氣"
//     },
//     {
//         "id": "EB099000",
//         "name": "其他"
//     },
// ];

const tsl_category_id_list = [
    {
        "id": "EB013000",
        "name": "塑膠",
        "color": "#0f4954"
    },
    {
        "id": "EB014000",
        "name": "紡織纖維",
        "color": "#7a4682"
    },
    {
        "id": "EB030000",
        "name": "化工",
        "color": "#3b4822"
    },
    {
        "id": "EB015000",
        "name": "電機機械",
        "color": "#7b4882"
    },
    {
        "id": "EB031000",
        "name": "生技醫療",
        "color": "#52b04f"
    },
    {
        "id": "EB020000",
        "name": "鋼鐵",
        "color": "#778999"
    },
    {
        "id": "EB026000",
        "name": "航運業",
        "color": "#188aed"
    },
    {
        "id": "EB027000",
        "name": "觀光",
        "color": "#6943d9"
    },
    {
        "id": "EB023000",
        "name": "電子",
        "color": "#ebe121"
    },
    {
        "id": "EB032000",
        "name": "半導體",
        "color": "#d44137"
    },
    {
        "id": "EB036000",
        "name": "電子零組件",
        "color": "#acf249"
    },
    {
        "id": "EB037000",
        "name": "電子通路",
        "color": "#14ffd8"
    },
    {
        "id": "EB034000",
        "name": "光電",
        "color": "#f28749"
    },
];

const otc_category_id_list = [
    {
        "id": "EB144000",
        "name": "紡織纖維",
        "color": "#7a4682"
    },
    {
        "id": "EB145000",
        "name": "電機機械",
        "color": "#7b4882"
    },
    {
        "id": "EB147000",
        "name": "化工",
        "color": "#3b4822"
    },
    {
        "id": "EB141000",
        "name": "生技醫療",
        "color": "#52b04f"
    },
    {
        "id": "EB150000",
        "name": "鋼鐵",
        "color": "#778999"
    },
    {
        "id": "EB153000",
        "name": "電子",
        "color": "#ebe121"
    },
    {
        "id": "EB162000",
        "name": "半導體",
        "color": "#d44137"
    },
    {
        "id": "EB164000",
        "name": "光電",
        "color": "#f28749"
    },
    {
        "id": "EB166000",
        "name": "電子零組件",
        "color": "#acf249"
    },
    {
        "id": "EB167000",
        "name": "電子通路",
        "color": "#14ffd8"
    },
    {
        "id": "EB156000",
        "name": "航運業",
        "color": "#188aed"
    },
    {
        "id": "EB157000",
        "name": "觀光",
        "color": "#6943d9"
    },
];